app/Controllers/Articulos.php

INSERT INTO `articulos` (`nombre`, `marca`, `precio`) VALUES ('javi', 'humilde', 'gratis')
---
    public function guardar()
    {
        $data = [];
        $data['nombre'] = $this->request->getPost('nombre');
        $data['marca'] = $this->request->getPost('marca');
        $data['precio'] = $this->request->getPost('precio');

        $imagen = $this->request->getFile('imagen');
        $nombreimagen = $imagen->getRandomName();
        // $nombreimagen = time();
        $imagen->move('../public/imagenes', $nombreimagen);

        $modelo = model(ArticulosModel::class);
        // var_dump($modelo);
        $modelo->save($data);

SELECT *
FROM `articulos`
---
    public function mostrarTodo()
    {
        $modelo = model(ArticulosModel::class);
        $data['articulos'] = $modelo->findAll();