app/Controllers/Usuarios.php

INSERT INTO `usuarios` (`nombre`, `direccion`, `dni`) VALUES ('asd', 'asd', 'asd')
---
    public function guardar()
    {
        $data = [];
        $data['nombre'] = $this->request->getPost('nombre');
        $data['contraseña1'] = $this->request->getPost('contraseña1');
        $data['contraseña1'] = $this->request->getPost('contraseña1');


        $modelo = model(UsuariosModel::class);
        $modelo->save($data);