app/Controllers/Usuarios.php

    public function validarUsuario()
    {
        $modelo = model(UsuariosModel::class);
        $modelo->select('id, nombre, contraseña1');

        $nombre = $this->request->getPost('nombre');
        $contraseña = $this->request->getPost('contraseña1');

        $modelo->where('nombre', $nombre);
        $modelo->where('contraseña1', $contraseña);
        $resultado = $modelo->find();
---
SELECT `id`, `nombre`, `contraseña1`
FROM `usuarios`
WHERE `nombre` = 'Erwin'
AND `contraseña1` = 'qweqweqwe'